package company.oracle.lastweekDash;

/*

 */
public class onsite1122 {
    /*
    sudoko
    第一轮，利口伞留一个白人CPP大神，非常扣细节，不要单单写普通的solution，而是要当作实际需要应用的api去写，
    中间讨论了空间O(1)情况下该怎么做（硬核每行每列每cube两两比较），或者空间够怎么优化（cache避免重复），以及遇到不合理的input怎么办？我提出抛出异常，然后继续讨论异常抛出的一些实际问题，还有如果不单单想知道valid or not，还想知道那个cell出问题了怎么办
     */


    /*
    第二轮，吃饭尬聊，没有我想象中的尬，manager和颜悦色然后不少bahavior question但是都属于聊聊自己经验就够的。
    吃了不到一个小时，居然紧赶慢赶回公司又给我出了一道coding题，检查一棵树是否是完全二叉树
     */

    /*
    第三轮，友善国人小哥，不知道lc有没有原题，就是给“1 2 + 3 *” 对应的算数式是（1 + 2）* 3输出0，不用考虑优先级，用一个stack做就好，follow up是如果实际应用中有很多新的符号，比如a & b = a * b - a，
    同时需要不断添加新的符号应该怎么处理，有点OOD的意思了，思路就是不同的符号使用不同subclass，也聊到了异常处理的问题
     */

    /*
    第四轮，bar raiser，基本全是BQ，上来让我介绍下自己组做的项目，然后自己在里面的contribution，中间大概十分钟让我自己选一个data structure他来出题，于是我就选了自己还算拿手的树，考了二叉树删除节点，
    这块我脑子秀逗了，代码写完才发现没有特殊处理根结点又反过头补，结果面试官头都不抬了来了句，it's good you can erase it，我第一反应就是凉凉了
     */

    /*
    第五轮，面试官说看我只有一年经验，那就考OOD吧，设计租车系统
     */
}
